{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {"id": 0, "content": "<unk>", "single_word": false, "lstrip": false, "rstrip": false, "normalized": false, "special": true},
    {"id": 1, "content": "<s>", "single_word": false, "lstrip": false, "rstrip": false, "normalized": false, "special": true},
    {"id": 2, "content": "</s>", "single_word": false, "lstrip": false, "rstrip": false, "normalized": false, "special": true}
  ],
  "normalizer": {"type": "Sequence", "normalizers": [{"type": "Prepend", "prepend": "▁"}]},
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": {"type": "Metaspace", "replacement": "▁", "add_prefix_space": true},
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": true,
    "vocab": {
      "<unk>": 0,
      "<s>": 1,
      "</s>": 2,
      "▁the": 3,
      "▁of": 4,
      "▁and": 5,
      "▁to": 6,
      "▁in": 7,
      "ing": 8,
      "▁a": 9
    },
    "merges": [
      "▁ t",
      "▁t he",
      "▁ o",
      "▁ a",
      "i ng"
    ]
  }
}
