{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 128000,
      "content": "<|begin_of_text|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 128001,
      "content": "<|end_of_text|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFC"
  },
  "pre_tokenizer": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true,
    "prepend_scheme": "first"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<|begin_of_text|>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<|begin_of_text|>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<|begin_of_text|>": {
        "id": "<|begin_of_text|>",
        "ids": [128000],
        "tokens": ["<|begin_of_text|>"]
      }
    }
  },
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true,
    "prepend_scheme": "first"
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": true,
    "vocab": {
      "<|begin_of_text|>": 128000,
      "<|end_of_text|>": 128001,
      "Hello": 9906,
      "world": 1917,
      "▁Neural": 8989,
      "▁network": 4632,
      "▁inference": 24044,
      "▁with": 449,
      "▁BitNet": 59558,
      "▁quantization": 12842,
      "The": 791,
      "▁quick": 4062,
      "▁brown": 14198,
      "▁fox": 39935,
      "▁jumps": 35308,
      "▁over": 927,
      "▁the": 279,
      "▁lazy": 16053,
      "▁dog": 5679
    },
    "merges": [
      "H e",
      "l l",
      "o o",
      "w o",
      "r l",
      "d d",
      "▁ N",
      "e u",
      "r a",
      "l l"
    ]
  }
}
